class OrderData:
    # Данные для теста с верхней кнопкой
    UPPER_BUTTON_DATA = [
        {
            "personal": ("Иван", "Петров", "ул. Ленина, 15", "Черкизовская", "89991234567"),
            "rental": ("20.04.2026", "сутки", "black", "Привезите самокат к 10:00")
        }
    ]
    
    # Данные для теста с нижней кнопкой
    LOWER_BUTTON_DATA = [
        {
            "personal": ("Мария", "Сидорова", "пр. Мира, 78", "Преображенская площадь", "89161234567"),
            "rental": ("11.04.2026", "трое суток", "grey", "Позвоните за 15 минут")
        }
    ]